<?php

require_once 'Mbll/Tower/ServiceApi.php';

/** @see Bll_Cache */
require_once 'Bll/Cache.php';


/**
 * Remote service api error description
 *
 * @package    Mbll/Tower
 * @copyright  Copyright (c) 2008 Community Factory Inc. (http://communityfactory.com)
 * @create     zx     2010-2-12
 */
class Mbll_Tower_ServiceErrorTpl
{

    private static $_prefix = 'Mbll_Tower_ServiceErrorTpl';

    /**
     * get cache key
     *
     * @param string $salt
     * @param mixi $params
     * @return string
     */
    private static function getCacheKey($salt, $params = null)
    {
        return Bll_Cache::getCacheKey(self::$_prefix, $salt, $params);
    }

	/**
     * clear cache
     *
     * @param string $salt
     */
    public static function clear()
    {
        Bll_Cache::delete(self::getCacheKey('getErrorArray'));
    }

    /**
     * get Error Description by code
     *
     * @param integer $errCode
     * @param string $lang
     * @return string
     */
    public static function getErrorDescription($errCode)
    {
        $key = self::getCacheKey('getErrorArray');

        if (!$result = Bll_Cache::get($key)) {
            $bllApi = new Mbll_Tower_ServiceApi();
            $result = $bllApi->getErrorMsgList();
            if ($result && $result['result'] && empty($result['error'])) {
                Bll_Cache::set($key, $result['result'], Bll_Cache::LIFE_TIME_ONE_MONTH);
                $result = $result['result'];
            }
        }

        return $result[$errCode];
    }

    /**
     * get Error Description array
     *
     * @return array
     */
    private static function _getErrorArray()
    {
        $aryRet = array(
        	'10000' => array('cn' => '登录超时，请刷新后再试～', 'jp' => ''),
        	'100' => array('cn' => '用户ID错误', 						'jp' => 'ユーザーIDエラー'),
            '101' => array('cn' => '用户信息错误', 	   				'jp' => 'ユーザー情報エラー'),
            '102' => array('cn' => '楼层ID错误', 						'jp' => 'フロアIDエラー'),
            '103' => array('cn' => '楼层信息错误', 					'jp' => 'フロア情報エラー'),
            '104' => array('cn' => 'GB不足', 						'jp' => 'Gコイン不足'),
            '105' => array('cn' => 'MB不足', 						'jp' => 'Mコイン不足'),
            '106' => array('cn' => '积分不足', 						'jp' => 'ポイント不足'),
            '108' => array('cn' => '不是楼层主人', 					'jp' => 'フロア主人ではない'),
            '109' => array('cn' => '不是店铺主人', 					'jp' => '店主ではない'),
            '110' => array('cn' => '请求用户信息失败', 				'jp' => 'ユーザー情報読み込み失敗'),
            '111' => array('cn' => '店铺等级未达到要求', 				'jp' => 'お店のレベルが要求に満たしません'),
            '112' => array('cn' => '店铺星级未达到要求', 				'jp' => 'お店の星レベルが要求に満たしません'),
            '113' => array('cn' => '你们不是好友', 					'jp' => 'お互いにマイミクではありません'),
            '114' => array('cn' => '道具数量不足', 					'jp' => '道具の数が足りないです'),
            '115' => array('cn' => '椅子ID错误', 						'jp' => '椅子ＩＤが間違います'),
            '116' => array('cn' => '道具ID错误', 						'jp' => '道具ＩＤが間違います'),
            '117' => array('cn' => '配置信息错误', 					'jp' => '道具がありません'),
            '201' => array('cn' => '系统初始化失败', 					'jp' => 'システム初期化失敗'),
            '202' => array('cn' => '获取大楼错误', 					'jp' => 'エラー'),
            '203' => array('cn' => '获取大楼错误', 					'jp' => 'エラー'),
            '204' => array('cn' => '新建用户失败', 					'jp' => '新しいユーザー登録失敗'),
            '205' => array('cn' => '没有空楼层', 						'jp' => '空いているフロアがありません'),
            '211' => array('cn' => '商店类型为空', 					'jp' => '店タイプが空いています'),
            '212' => array('cn' => '未填店铺名或店铺名长度超长', 		'jp' => '店の名前が長すぎるかもしくは記入されていないです'),
            '213' => array('cn' => '楼层不存在', 								'jp' => 'このフロアは存在していません'),
            '214' => array('cn' => '楼层已经被人租了', 						'jp' => 'このフロアはもう賃貸されました'),
            '215' => array('cn' => '房产已到最大限制数量', 						'jp' => '不動産上限です'),
            '216' => array('cn' => '要租下第二家店必须将所有店铺升级到3星级以上', 	'jp' => '二つ目のフロアを借りるにはすべての'),
            '217' => array('cn' => '要租下第三家店必须有一家店升级为3星级', 		'jp' => '三つ目のフロアを借りるには、ユーザーレベル４０になることが必要です。'),
            '218' => array('cn' => '更新用户店铺信息出错', 				'jp' => 'ユーザー店情報更新エラー'),
            '219' => array('cn' => '更新商店大楼信息出错', 				'jp' => 'ショッピングセンター情報更新エラー'),
            '220' => array('cn' => '初始化椅子失败', 					'jp' => '椅子の初始化に失敗'),
            '231' => array('cn' => '捧或踩类型错误', 					'jp' => '褒めるもしくはやじるタイプが間違います'),
            '232' => array('cn' => '次数已满', 						'jp' => 'これ以上はできません'),
            '233' => array('cn' => '捧/踩不能对自己操作', 				'jp' => '自分自身を褒める/野次ることはできません'),
            '234' => array('cn' => '捧/踩失败', 						'jp' => '褒める/野次ることに失敗しました'),
            '235' => array('cn' => '扣除GB失败', 						'jp' => 'れ以上はできません'),
            '241' => array('cn' => '签名不能为空', 					'jp' => 'サインが書いてありません'),
            '242' => array('cn' => '签名含有违禁字', 					'jp' => 'サインに禁句が含まれています'),
            '243' => array('cn' => '修改签名失败', 					'jp' => 'サインの変更に失敗'),
            '251' => array('cn' => '意见类型不正确', 					'jp' => '意見タイプ不正確'),
            '252' => array('cn' => '意见内容不符合', 					'jp' => '意見内容不適切'),
            '253' => array('cn' => '提交意见失败', 					'jp' => '意見提出失敗'),
            '254' => array('cn' => '今天已经回答过问题', 				'jp' => '今日の問題に答えました'),
            '261' => array('cn' => '店铺类型不正确','jp' => ''),
            '262' => array('cn' => '注销楼层失败','jp' => ''),
            '263' => array('cn' => '重置楼层失败','jp' => ''),
            '264' => array('cn' => '搬迁楼层失败','jp' => ''),
            '301' => array('cn' => '更新用户信息失败', 				'jp' => 'ユーザー情報更新に失敗'),
            '302' => array('cn' => '答案提交错误', 					'jp' => '回答の提出エラー'),
            '303' => array('cn' => '已经回答过问题', 					'jp' => 'すでに問題に答えました'),
            '401' => array('cn' => '加载座椅失败', 					'jp' => '休憩用の椅子読み込み失敗'),
            '411' => array('cn' => '店铺名字不符合', 					'jp' => '店の名前が不適切'),
            '421' => array('cn' => '店铺星级错误', 					'jp' => '店の星レベルエラー'),
            '422' => array('cn' => '店铺等级未达到要求', 				'jp' => '店のレベルが要求を満たしていない'),
            '423' => array('cn' => '店铺升星失败', 					'jp' => '店の星レベルアップ失敗'),
            '431' => array('cn' => '椅子类型错误', 					'jp' => '椅子タイプエラー'),
            '432' => array('cn' => '椅子不存在', 						'jp' => '椅子が存在しません'),
            '433' => array('cn' => '没有该级别', 						'jp' => 'このレベルがありません'),
            '434' => array('cn' => '升级椅子失败', 					'jp' => '椅子レベルアップに失敗'),
            '435' => array('cn' => '未能达到扩展条件', 				'jp' => '増築要求に満たしません'),
            '436' => array('cn' => '扩展椅子失败', 					'jp' => '椅子増築失敗'),
            '437' => array('cn' => '升级椅子失败', 					'jp' => '椅子のレベルアップに失敗しました'),
            '441' => array('cn' => '今天不能再扔垃圾啦', 				'jp' => '今日はもうゴミを捨てることができません'),
            '442' => array('cn' => '不能清理垃圾', 					'jp' => 'ゴミを掃除することができません'),
            '501' => array('cn' => '椅子信息错误', 					'jp' => '椅子情報エラー'),
            '502' => array('cn' => '椅子上没有客人', 					'jp' => '椅子にお客さんがいません'),
            '503' => array('cn' => '椅子上已经有客人', 				'jp' => '椅子にもうお客さんがいます'),
            '504' => array('cn' => '更新椅子失败', 					'jp' => '椅子の更新に失敗'),
            '505' => array('cn' => '客人状态错误', 					'jp' => 'お客さん状態が間違っています'),
            '511' => array('cn' => '客人不需要该道具', 				'jp' => 'この道具ではありません'),
            '512' => array('cn' => '你不能使用该道具', 				'jp' => '道具が足りません'),
            '513' => array('cn' => '已经使用过加速', 					'jp' => 'もう加速しました'),
            '514' => array('cn' => '使用道具失败', 					'jp' => '道具使用に失敗'),
            '521' => array('cn' => '没有空位子', 						'jp' => '空いている席がありません'),
            '522' => array('cn' => '等级未达到要求', 					'jp' => 'レベルが要求を満たしません'),
            '523' => array('cn' => '客人心情好着了', 					'jp' => 'お客さんの機嫌がとてもいいです'),
            '524' => array('cn' => '店铺类型不同', 					'jp' => '店のタイプが異なります'),
            '525' => array('cn' => '拉客人失败', 						'jp' => 'お客さんの招待に失敗'),
            '526' => array('cn' => '不能帮别人拉客人', 				'jp' => 'マイミクの変わりにお客さんを招待できません'),
            '531' => array('cn' => '你已经捡过了', 					'jp' => 'もう拾いました'),
            '532' => array('cn' => '捡取物品失败', 					'jp' => 'アイテムを拾う操作に失敗'),
            '533' => array('cn' => '已经不能再捡了', 					'jp' => 'もう拾うことができません'),
            '534' => array('cn' => '捡取失败', 						'jp' => '拾う操作に失敗'),
            '551' => array('cn' => '今天不能再邀请了', 					'jp' => '鬼は福豆だけで加速できます！'),
            '552' => array('cn' => '不能邀请该客人','jp' => ''),
            '553' => array('cn' => '花篮数目错误','jp' => ''),
            '601' => array('cn' => '用户ID为空', 						'jp' => 'ユーザーIDが空いています'),
            '602' => array('cn' => '获取好友列表失败', 				'jp' => 'マイミクリスト獲得に失敗'),
            '603' => array('cn' => '获取黑名单失败', 					'jp' => 'ブラックリスト獲得に失敗'),
            '604' => array('cn' => '要添加的好友ID为空', 				'jp' => '追加するマイミクのIDが空いています'),
            '605' => array('cn' => '已经是好友关系了', 				'jp' => 'すでにマイミク関係になっています'),
            '606' => array('cn' => '添加好友处理失败', 				'jp' => 'マイミク追加失敗'),
            '607' => array('cn' => '服务器繁忙', 						'jp' => 'サーバー'),
            '608' => array('cn' => '删除好友处理失败', 				'jp' => '友達削除操作に失敗'),
            '609' => array('cn' => '正在等待好友验证', 				'jp' => '友達の承認を待っています'),
            '610' => array('cn' => '获取好友来源失败', 				'jp' => '友達ソース獲得に失敗'),
            '611' => array('cn' => '不是好友关系,无法删除', 			'jp' => '友達関係ではないから、削除できません'),
            '612' => array('cn' => '你不可以加自己为好友', 				'jp' => '自分を友達に加えることができません'),
            '613' => array('cn' => '邀请好友ID为空', 					'jp' => '招待するマイミクのIDが空いています'),
            '614' => array('cn' => '已经发送过请求','jp' => ''),
            '615' => array('cn' => '增加请求总数失败','jp' => ''),
            '616' => array('cn' => '发送请求失败','jp' => ''),
            '624' => array('cn' => '我的游戏内好友大于等于sns好友，不能发请求', 	'jp' => 'フロアミク数がまいミク数を上回りますので、リクエストできません'),
            '625' => array('cn' => '我的游戏内好友大于等于sns好友，不能通过请求', 	'jp' => 'フロアミクがマイミク数を上回りますのでリクエストできません'),
            '626' => array('cn' => '对方的游戏内好友大于等于sns好友，不能通过请求', 	'jp' => '相手のフロアミク数がマイミク数を上回りますので、リクエストできません'),
            '801' => array('cn' => '道具数量为空', 					'jp' => '道具が足りません'),
            '802' => array('cn' => '数量有误', 'jp' => ''),
            '803' => array('cn' => '该商品不存在', 'jp' => ''),
            '804' => array('cn' => '没有楼层不能购买物品', 'jp' => ''),
            '805' => array('cn' => '积分兑换失败', 'jp' => ''),
            '830' => array('cn' => '赠送礼物用户账号错误', 'jp' => ''),
            '831' => array('cn' => '礼物ID错误', 'jp' => ''),
            '833' => array('cn' => '礼物数量错误', 'jp' => ''),
            '834' => array('cn' => '不能送自己礼物', 'jp' => ''),
            '835' => array('cn' => '隐私参数错误', 'jp' => ''),
            '836' => array('cn' => '广播参数错误', 'jp' => ''),
            '837' => array('cn' => '留言错误', 'jp' => ''),
            '842' => array('cn' => '礼物id不存在', 'jp' => ''),
            '843' => array('cn' => '用户信息读取错误', 'jp' => ''),
            '847' => array('cn' => 'mb不足', 'jp' => ''),
            '848' => array('cn' => '加道具失败', 'jp' => ''),
            '846' => array('cn' => 'gb不足', 'jp' => ''),
            '850' => array('cn' => '获取礼物日志出错', 'jp' => ''),
            '853' => array('cn' => '扣币失败', 'jp' => ''),
            '854' => array('cn' => '执行失败', 'jp' => ''),
            '912' => array('cn' => '留言内容为空', 'jp' => ''),
            '913' => array('cn' => '留言内容过长', 'jp' => ''),
            '903' => array('cn' => '添加留言失败', 'jp' => ''),
            '904' => array('cn' => '留言Id为空', 'jp' => ''),
            '905' => array('cn' => '回复内容为空', 'jp' => ''),
            '906' => array('cn' => '回复内容过长', 'jp' => ''),
            '907' => array('cn' => '添加回复失败', 'jp' => ''),
            '908' => array('cn' => '获取留言回复失败', 'jp' => ''),
            '909' => array('cn' => '无权删除留言回复', 'jp' => ''),
            '910' => array('cn' => '删除留言失败', 'jp' => ''),
            '911' => array('cn' => '留言回复含有关键字', 'jp' => ''),
            '1001' => array('cn' => '道具数量为空', 'jp' => ''),
            '1002' => array('cn' => '道具不存在', 'jp' => ''),
            '1003' => array('cn' => '道具过期', 'jp' => ''),
            '1004' => array('cn' => '道具使用次数不足', 'jp' => ''),
            '1005' => array('cn' => '赠送道具失败', 'jp' => ''),
            '1006' => array('cn' => '赠送道具失败', 'jp' => ''),
            '1007' => array('cn' => '设置道具失败', 'jp' => ''),
            '1008' => array('cn' => '查询活动道具失败', 'jp' => ''),
            '1009' => array('cn' => '随机赠送道具失败', 'jp' => ''),
            '1010' => array('cn' => '使用不正确的道具', 'jp' => ''),
            '1011' => array('cn' => '设置道具失败', 'jp' => ''),
            '1101' => array('cn' => '排行类型为空', 'jp' => ''),
            '1102' => array('cn' => '页码为空', 'jp' => ''),
            '1103' => array('cn' => '查询个人排行失败', 'jp' => ''),
            '1104' => array('cn' => '查询店铺等级排行失败', 'jp' => ''),
            '1105' => array('cn' => '查询店铺捧场值失败', 'jp' => ''),
            '1106' => array('cn' => '查询我的排行失败', 'jp' => ''),
            '1107' => array('cn' => '查询上升最快排行失败', 'jp' => ''),
            '2001' => array('cn' => '道具数量为空', 'jp' => '道具の数がゼロになっています'),
            '2002' => array('cn' => '道具不存在', 'jp' => '道具が存在しません'),
            '2003' => array('cn' => '道具过期', 'jp' => '道具有効期間が満了しました'),
            '2004' => array('cn' => '道具使用次数不足', 'jp' => '道具の使用回数が足りません'),
            '2005' => array('cn' => '已领礼物', 'jp' => 'もう道具をゲットしました'),
            '2006' => array('cn' => '增加礼物失败', 'jp' => '道具の送りに失敗しました'),
            '2007' => array('cn' => '设置道具失败', 'jp' => '道具の設置に失敗しました'),
            '2008' => array('cn' => '查询活动道具失败', 'jp' => 'イベント道具の読み込みに失敗しました'),
            '2009' => array('cn' => '随机赠送道具失败', 'jp' => 'ランダム道具の送りに失敗しました'),
            '2010' => array('cn' => '道具使用位置错误', 'jp' => '道具を間違っている位置に使いました'),
            '2011' => array('cn' => '饰品错误', 'jp' => '飾り更新失敗'));

        return $aryRet;
    }

}